# ---------------------------------------------------------- #

sPAWN_TEXT = [
    "💘 ᴀ **{rarity} ᴡᴀɪғᴜ** ʜᴀs ᴀᴘᴘᴇᴀʀᴇᴅ ᴡɪᴛʜ ᴀ ɢʟɪᴍᴍᴇʀ ɪɴ ʜᴇʀ ᴇʏᴇs... /grab ʜᴇʀ ʙᴇғᴏʀᴇ sʜᴇ ᴠᴀɴɪsʜᴇs~",
    "💋 ʜᴇʏ ᴅᴀʀʟɪɴɢ... ᴀ **{rarity} ᴡᴀɪғᴜ** ᴊᴜsᴛ ʟᴀɴᴅᴇᴅ ᴡɪᴛʜ ᴀ ғʟɪʀᴛʏ ɢʀɪɴ... /grab ʜᴇʀ ɴᴏᴡ~",
    "🖤 sʜᴇ ʟɪᴄᴋᴇᴅ ʜᴇʀ ʟɪᴘs... ʏᴇs, ᴀ **{rarity} ᴡᴀɪғᴜ** ɪs ʀᴇᴀᴅʏ ғᴏʀ ʏᴏᴜ... /grab~",
    "🌹 ᴀ **{rarity} ᴡᴀɪғᴜ** ʏᴏᴜ ᴄᴀɴ’ᴛ ʀᴇsɪsᴛ ʜᴀs ᴀᴘᴘᴇᴀʀᴇᴅ... ʜᴜʀʀʏ ᴀɴᴅ /grab~",
    "😈 ᴡɪᴛʜ ᴀ ᴛᴇᴀsɪɴɢ sᴍɪʀᴋ, ᴀ **{rarity} ᴡᴀɪғᴜ** ᴀᴘᴘᴇᴀʀᴇᴅ... ᴅᴏɴ’ᴛ ʟᴇᴛ ʜᴇʀ sʟɪᴘ~ /grab",
    "🕊 ᴀ **{rarity} ᴡᴀɪғᴜ** ғᴇʟʟ ғʀᴏᴍ ʜᴇᴀᴠᴇɴ ᴛᴏ ʙᴇ ʏᴏᴜʀs... /grab ʜᴇʀ ʙᴇғᴏʀᴇ ᴛʜᴇ ᴄʜᴀɴᴄᴇ ɢᴏᴇs~",
    "🔥 ᴛʜᴇ ᴀɪʀ ɢᴏᴛ ʜᴏᴛᴛᴇʀ... ᴀ **{rarity} ᴡᴀɪғᴜ** ɪs ʜᴇʀᴇ ᴛᴏ ᴘʟᴀʏ~ /grab ғᴀsᴛ~",
    "✨ ʏᴏᴜ ʜᴇᴀʀᴅ ᴛʜᴀᴛ ʙᴇʟʟ? ᴀ **{rarity} ᴡᴀɪғᴜ** ʜᴀs sᴘᴀᴡɴᴇᴅ... /grab ᴏʀ ʟᴏsᴇ ʜᴇʀ",
    "💄 sʜᴇ ᴅᴏᴇsɴ’ᴛ ᴡᴀɴᴛ ʟᴏᴠᴇ... ᴛʜᴇ **{rarity} ᴡᴀɪғᴜ** ᴡᴀɴᴛs ᴏᴡɴᴇʀsʜɪᴘ... /grab ᴛᴏ ᴄʟᴀɪᴍ",
    "👑 ᴀ **{rarity} ᴡᴀɪғᴜ** sᴛᴇᴘᴘᴇᴅ ɪɴ ʟɪᴋᴇ ʀᴏʏᴀʟᴛʏ... ʙᴇ ʙʀᴀᴠᴇ, /grab ʜᴇʀ ғɪʀsᴛ~"
]

# ---------------------------------------------------------- #

MISSED_GRAB_TEXT = [
    "💨 **{name}** sᴍɪʀᴋᴇᴅ ᴀɴᴅ ᴅɪsᴀᴘᴘᴇᴀʀᴇᴅ ɪɴ ᴀ ᴡʜɪsᴘᴇʀ ᴏғ ᴘᴀʀғᴜᴍᴇ~",
    "😢 **{name}** ᴡᴀɪᴛᴇᴅ ғᴏʀ sᴏᴍᴇᴏɴᴇ... ʙᴜᴛ ɴᴏ ᴏɴᴇ ᴄᴀʟʟᴇᴅ /grab~",
    "🖤 sʜᴇ ɢᴀᴢᴇᴅ ɪɴ ᴛʜᴇ ᴄʀᴏᴡᴅ... **{name}** ʟᴏsᴛ ᴀʟʟ ʜᴏᴘᴇ ᴀɴᴅ ʟᴇғᴛ~",
    "💔 **{name}** ᴡᴀs ʀᴇᴀᴅʏ ᴛᴏ ʙᴇ ʏᴏᴜʀs, ʙᴜᴛ ɴᴏ ᴏɴᴇ ᴅᴀʀᴇᴅ ᴛᴏ /grab~",
    "👋 ᴡɪᴛʜ ᴀ sɪɴɪsᴛᴇʀ sᴍɪʟᴇ, **{name}** ᴛᴜʀɴᴇᴅ ᴀʀᴏᴜɴᴅ... ɴᴏ ᴏɴᴇ sᴛᴏᴘᴘᴇᴅ ʜᴇʀ~",
    "🕸 **{name}** ɴᴇᴠᴇʀ ʙᴇʟᴏɴɢᴇᴅ ᴛᴏ ᴀɴʏᴏɴᴇ... ᴀɴᴅ ɴᴏᴛ ᴇᴠᴇɴ ʏᴏᴜ~",
    "😶 **{name}** ʟᴇғᴛ ʏᴏᴜ ʙᴇʜɪɴᴅ ᴡɪᴛʜ ɴᴏ ᴡᴏʀᴅs... ʏᴏᴜ ᴡᴇʀᴇɴ’ᴛ ʙʀᴀᴠᴇ ᴇɴᴏᴜɢʜ~",
    "🌫️ sᴏ ᴄʟᴏsᴇ, sᴏ ғᴀʀ... **{name}** sʟɪᴘᴘᴇᴅ ᴏᴜᴛ ᴏғ ʀᴇᴀʟɪᴛʏ~"
]
