# ---------------------------------------------------------- #

SPAWN_TEXT = [
    "**💘 ᴀ {rank} ᴡᴀɪғᴜ ʜᴀs ᴀᴘᴘᴇᴀʀᴇᴅ ᴡɪᴛʜ ᴀ ɢʟɪᴍᴍᴇʀ ɪɴ ʜᴇʀ ᴇʏᴇs... /grab ʜᴇʀ ʙᴇғᴏʀᴇ sʜᴇ ᴠᴀɴɪsʜᴇs~**",
    "**💋 ʜᴇʏ ᴅᴀʀʟɪɴɢ... ᴀ {rank} ᴡᴀɪғᴜ ᴊᴜsᴛ ʟᴀɴᴅᴇᴅ ᴡɪᴛʜ ᴀ ғʟɪʀᴛʏ ɢʀɪɴ... /grab ʜᴇʀ ɴᴏᴡ~**",
    "**🖤 sʜᴇ ʟɪᴄᴋᴇᴅ ʜᴇʀ ʟɪᴘs... ʏᴇs, ᴀ {rank} ᴡᴀɪғᴜ ɪs ʀᴇᴀᴅʏ ғᴏʀ ʏᴏᴜ... /grab~**",
    "**🌹 ᴀ {rank} ᴡᴀɪғᴜ ʏᴏᴜ ᴄᴀɴ’ᴛ ʀᴇsɪsᴛ ʜᴀs ᴀᴘᴘᴇᴀʀᴇᴅ... ʜᴜʀʀʏ ᴀɴᴅ /grab~**",
    "**😈 ᴡɪᴛʜ ᴀ ᴛᴇᴀsɪɴɢ sᴍɪʀᴋ, ᴀ {rank} ᴡᴀɪғᴜ ᴀᴘᴘᴇᴀʀᴇᴅ... ᴅᴏɴ’ᴛ ʟᴇᴛ ʜᴇʀ sʟɪᴘ~ /grab**",
    "**🕊 ᴀ {rank} ᴡᴀɪғᴜ ғᴇʟʟ ғʀᴏᴍ ʜᴇᴀᴠᴇɴ ᴛᴏ ʙᴇ ʏᴏᴜʀs... /grab ʜᴇʀ ʙᴇғᴏʀᴇ ᴛʜᴇ ᴄʜᴀɴᴄᴇ ɢᴏᴇs~**",
    "**🔥 ᴛʜᴇ ᴀɪʀ ɢᴏᴛ ʜᴏᴛᴛᴇʀ... ᴀ {rank} ᴡᴀɪғᴜ ɪs ʜᴇʀᴇ ᴛᴏ ᴘʟᴀʏ~ /grab ғᴀsᴛ~**",
    "**✨ ʏᴏᴜ ʜᴇᴀʀᴅ ᴛʜᴀᴛ ʙᴇʟʟ? ᴀ {rank} ᴡᴀɪғᴜ ʜᴀs sᴘᴀᴡɴᴇᴅ... /grab ᴏʀ ʟᴏsᴇ ʜᴇʀ**",
    "**💄 sʜᴇ ᴅᴏᴇsɴ’ᴛ ᴡᴀɴᴛ ʟᴏᴠᴇ... ᴛʜᴇ {rank} ᴡᴀɪғᴜ ᴡᴀɴᴛs ᴏᴡɴᴇʀsʜɪᴘ... /grab ᴛᴏ ᴄʟᴀɪᴍ**",
    "**👑 ᴀ {rank} ᴡᴀɪғᴜ sᴛᴇᴘᴘᴇᴅ ɪɴ ʟɪᴋᴇ ʀᴏʏᴀʟᴛʏ... ʙᴇ ʙʀᴀᴠᴇ, /grab ʜᴇʀ ғɪʀsᴛ~**"
]

# ---------------------------------------------------------- #

MISSED_GRAB_TEXT = [
    "**💨 {name} sᴍɪʀᴋᴇᴅ ᴀɴᴅ ᴅɪsᴀᴘᴘᴇᴀʀᴇᴅ ɪɴ ᴀ ᴡʜɪsᴘᴇʀ ᴏғ ᴘᴀʀғᴜᴍᴇ~**",
    "**😢 {name} ᴡᴀɪᴛᴇᴅ ғᴏʀ sᴏᴍᴇᴏɴᴇ... ʙᴜᴛ ɴᴏ ᴏɴᴇ ᴄᴀʟʟᴇᴅ /grab~**",
    "**🖤 sʜᴇ ɢᴀᴢᴇᴅ ɪɴ ᴛʜᴇ ᴄʀᴏᴡᴅ... {name} ʟᴏsᴛ ᴀʟʟ ʜᴏᴘᴇ ᴀɴᴅ ʟᴇғᴛ~**",
    "**💔 {name} ᴡᴀs ʀᴇᴀᴅʏ ᴛᴏ ʙᴇ ʏᴏᴜʀs, ʙᴜᴛ ɴᴏ ᴏɴᴇ ᴅᴀʀᴇᴅ ᴛᴏ /grab~**",
    "**👋 ᴡɪᴛʜ ᴀ sɪɴɪsᴛᴇʀ sᴍɪʟᴇ, {name} ᴛᴜʀɴᴇᴅ ᴀʀᴏᴜɴᴅ... ɴᴏ ᴏɴᴇ sᴛᴏᴘᴘᴇᴅ ʜᴇʀ~**",
    "**🕸 {name} ɴᴇᴠᴇʀ ʙᴇʟᴏɴɢᴇᴅ ᴛᴏ ᴀɴʏᴏɴᴇ... ᴀɴᴅ ɴᴏᴛ ᴇᴠᴇɴ ʏᴏᴜ~**",
    "**😶 {name} ʟᴇғᴛ ʏᴏᴜ ʙᴇʜɪɴᴅ ᴡɪᴛʜ ɴᴏ ᴡᴏʀᴅs... ʏᴏᴜ ᴡᴇʀᴇɴ’ᴛ ʙʀᴀᴠᴇ ᴇɴᴏᴜɢʜ~**",
    "**🌫️ sᴏ ᴄʟᴏsᴇ, sᴏ ғᴀʀ... {name} sʟɪᴘᴘᴇᴅ ᴏᴜᴛ ᴏғ ʀᴇᴀʟɪᴛʏ~**"
]

# ---------------------------------------------------------- #

GRAB_TEXT = [
    "**💖 ʏᴏᴜ ɢᴇɴᴛʟʏ ᴄᴀᴜɢʜᴛ ʜᴇʀ ɢᴀᴢᴇ... ᴀɴᴅ ɴᴏᴡ {name} ɪs sᴀғᴇ ɪɴ ʏᴏᴜʀ ᴀʀᴍs~**",
    "**💋 ᴏᴏʜ~ ᴛʜᴀᴛ ᴛᴏᴜᴄʜ ᴡᴀs sᴏ ꜱᴍᴏᴏᴛʜ... {name} sᴀʏs ʏᴏᴜ ʙᴇʟᴏɴɢ ᴛᴏ ʜᴇʀ ɴᴏᴡ 😘**",
    "**🔥 ʏᴏᴜ sɴᴀᴛᴄʜᴇᴅ {name} ʙᴇғᴏʀᴇ ᴀɴʏᴏɴᴇ ᴄᴏᴜʟᴅ ᴇᴠᴇɴ ʙʟɪɴᴋ — ᴛʜᴀᴛ ᴡᴀs sᴇxʏ~**",
    "**💞 ʜᴇʀ ᴄʜᴇᴇᴋs ᴀʀᴇ ʀᴇᴅ, ʜᴇʀ ʜᴇᴀʀᴛ ʀᴀᴄɪɴɢ — {name} ɪs ᴀʟʟ ʏᴏᴜʀs ɴᴏᴡ~**",
    "**😏 ᴡɪᴛʜ ᴀ ꜰʟɪʀᴛʏ sᴍɪʀᴋ, {name} sᴜʀʀᴇɴᴅᴇʀᴇᴅ ʜᴇʀsᴇʟғ ᴛᴏ ʏᴏᴜ~**",
    "**🎀 ʏᴏᴜ ᴛᴀᴍᴇᴅ ᴛʜᴇ ᴜɴᴛᴀᴍᴀʙʟᴇ... ɴᴏᴡ {name} ɪs ᴘᴀʀᴛ ᴏғ ʏᴏᴜʀ ʜᴀʀᴇᴍ 💘**",
    "**👑 ɴᴏʙᴏᴅʏ ᴇʟsᴇ ᴅᴀʀᴇᴅ — ʙᴜᴛ ʏᴏᴜ ᴅɪᴅ ɪᴛ. {name} ɪs ʏᴏᴜʀs ғᴏʀᴇᴠᴇʀ~**",
    "**🖤 ᴛʜᴇ ᴡᴏʀʟᴅ ꜱʟᴏᴡᴇᴅ ᴅᴏᴡɴ ᴀs {name} ғᴇʟʟ ɪɴᴛᴏ ʏᴏᴜʀ ᴀʀᴍs... ʜᴀʀᴇᴍ ᴜᴘᴅᴀᴛᴇᴅ~**",
    "**💘 sʜᴇ ᴡᴀs ʀᴇᴀᴅʏ ғᴏʀ ʏᴏᴜ... ᴀɴᴅ ʏᴏᴜ ᴅɪᴅɴ’ᴛ ᴅɪsᴀᴘᴘᴏɪɴᴛ — {name} sᴍɪʟᴇs ꜱᴏғᴛʟʏ~**",
    "**💞 {name} ᴊᴏɪɴᴇᴅ ʏᴏᴜʀ ʜᴀʀᴇᴍ ᴡɪᴛʜ ᴀ ᴡɪɴᴋ... ʏᴏᴜʀ ɢᴀᴍᴇ ɪꜱ sᴛʀᴏɴɢ~**"
]

GUIDE_TEXT = """
Here are all the commands related to the waifu grabber.

- `/grab`: 
- `/animes`: 
- `/mywaifus`: 
- `/gift`: 
- `/harem`: 
- `/spawntime`: 
- `trade`: 
"""

START_TEXT = """
Hello {}!
I’m {}. Every grab could unlock a rare waifu from the anime multiverse. Build your collection, trade smart, and rise through the ranks.
Your journey to becoming the ultimate collector starts now. 💎🔥
"""
